In [1]:
"""EXERCISE 4: ETL with Tools and Frameworks (Pandas + SQLite)
Scenario: You're working for a retail company.
Sales records are stored in a SQLite database.
Some records contain missing values, duplicates, or inconsistent formats.
Clean and export this data.
"""

"EXERCISE 4: ETL with Tools and Frameworks (Pandas + SQLite)\nScenario: You're working for a retail company.\nSales records are stored in a SQLite database.\nSome records contain missing values, duplicates, or inconsistent formats.\nClean and export this data.\n"

In [1]:
import pandas as pd
from sqlalchemy import create_engine, inspect

ModuleNotFoundError: No module named 'pandas'

In [3]:
df = pd.read_csv('/content/encoded-Program4_sales_data (1).csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 25 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       2823 non-null   int64
 1   QUANTITYORDERED   2823 non-null   int64
 2   PRICEEACH         2823 non-null   float64
 3   ORDERLINENUMBER   2823 non-null   int64
 4   SALES             2823 non-null   float64
 5   ORDERDATE         2823 non-null   object
 6   STATUS            2823 non-null   object
 7   QTR_ID            2823 non-null   int64
 8   MONTH_ID          2823 non-null   int64
 9   YEAR_ID           2823 non-null   int64
 10  PRODUCTLINE       2823 non-null   object
 11  MSRP              2823 non-null   int64
 12  PRODUCTCODE       2823 non-null   object
 13  CUSTOMERNAME      2823 non-null   object
 14  PHONE             2823 non-null   object
 15  ADDRESSLINE1      2823 non-null   object
 16  ADDRESSLINE2      302 non-null    object
 17  CITY              2823 non-null   object
 18  STATE             1337 non-null   object
 19  POSTALCODE        2747 non-null   object
 20  COUNTRY           2823 non-null   object
 21  TERRITORY         1749 non-null   object
 22  CONTACTLASTNAME   2823 non-null   object
 23  CONTACTFIRSTNAME  2823 non-null   object
 24  DEALSIZE          2823 non-null   object
dtypes: float64(2), int64(7), object(16)
memory usage: 551.5+ KB

In [5]:
(df.isnull().sum()/df.shape[0])*100

ORDERNUMBER          0.000000
QUANTITYORDERED      0.000000
PRICEEACH            0.000000
ORDERLINENUMBER      0.000000
SALES                0.000000
ORDERDATE            0.000000
STATUS               0.000000
QTR_ID               0.000000
MONTH_ID             0.000000
YEAR_ID              0.000000
PRODUCTLINE          0.000000
MSRP                 0.000000
PRODUCTCODE          0.000000
CUSTOMERNAME         0.000000
PHONE                0.000000
ADDRESSLINE1         0.000000
ADDRESSLINE2        89.302161
CITY                 0.000000
STATE               52.639036
POSTALCODE           2.692171
COUNTRY              0.000000
TERRITORY           38.044633
CONTACTLASTNAME      0.000000
CONTACTFIRSTNAME     0.000000
DEALSIZE             0.000000
dtype: float64

In [6]:
df.drop(columns=['ADDRESSLINE2', 'STATE'], inplace=True)

In [8]:
(df.isnull().sum()/df.shape[0])*100

ORDERNUMBER          0.000000
QUANTITYORDERED      0.000000
PRICEEACH            0.000000
ORDERLINENUMBER      0.000000
SALES                0.000000
ORDERDATE            0.000000
STATUS               0.000000
QTR_ID               0.000000
MONTH_ID             0.000000
YEAR_ID              0.000000
PRODUCTLINE          0.000000
MSRP                 0.000000
PRODUCTCODE          0.000000
CUSTOMERNAME         0.000000
PHONE                0.000000
ADDRESSLINE1         0.000000
CITY                 0.000000
POSTALCODE           2.692171
COUNTRY              0.000000
TERRITORY           38.044633
CONTACTLASTNAME      0.000000
CONTACTFIRSTNAME     0.000000
DEALSIZE             0.000000
dtype: float64

In [12]:
df['POSTALCODE'] = df['POSTALCODE'].fillna(df['POSTALCODE'].mode()[0])
df['TERRITORY'] = df['TERRITORY'].fillna(df['TERRITORY'].mode()[0])

In [13]:
(df.isnull().sum()/df.shape[0])*100

ORDERNUMBER         0.0
QUANTITYORDERED     0.0
PRICEEACH           0.0
ORDERLINENUMBER     0.0
SALES               0.0
ORDERDATE           0.0
STATUS              0.0
QTR_ID              0.0
MONTH_ID            0.0
YEAR_ID             0.0
PRODUCTLINE         0.0
MSRP                0.0
PRODUCTCODE         0.0
CUSTOMERNAME        0.0
PHONE               0.0
ADDRESSLINE1        0.0
CITY                0.0
POSTALCODE          0.0
COUNTRY             0.0
TERRITORY           0.0
CONTACTLASTNAME     0.0
CONTACTFIRSTNAME    0.0
DEALSIZE            0.0
dtype: float64

In [15]:
df.duplicated().sum()

np.int64(0)

In [16]:
print("\nCleaned Data:\n", df)
df.to_csv("cleaned_250902_data.csv", index=False)
print("\nCleaned data saved to 'cleaned_250902_data.csv'")

Cleaned Data:
       ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0           10107               30      95.70                2  2871.00
1           10121               34      81.35                5  2765.90
2           10134               41      94.74                2  3884.34
3           10145               45      83.26                6  3746.70
4           10159               49     100.00               14  5205.27
...           ...              ...        ...              ...      ...
2818        10350               20     100.00               15  2244.40
2819        10373               29     100.00                1  3978.51
2820        10386               43     100.00                4  5417.57
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0      2/24/2003 0:00   Shipped       1         2     2003  ...
1       5/7/2003 0:00   Shipped       2         5     2003  ...
2       7/1/2003 0:00   Shipped       3         7     2003  ...
3      8/25/2003 0:00   Shipped       3         8     2003  ...
4     10/10/2003 0:00   Shipped       4        10     2003  ...
...               ...       ...     ...       ...      ...  ...
2818   12/2/2004 0:00   Shipped       4        12     2004  ...
2819   1/31/2005 0:00   Shipped       1         1     2005  ...
2820    3/1/2005 0:00  Resolved       1         3     2005  ...
2821   3/28/2005 0:00   Shipped       1         3     2005  ...
2822    5/6/2005 0:00   On Hold       2         5     2005  ...

                  CUSTOMERNAME             PHONE  \
0            Land of Toys Inc.        2125557818
1           Reims Collectables        26.47.1555
2              Lyon Souveniers  +33 1 46 62 7555
3            Toys4GrownUps.com        6265557265
4     Corporate Gift Ideas Co.        6505551386
...                        ...               ...
2818     Euro Shopping Channel    (91) 555 94 44
2819   Oulu Toy Supplies, Inc.        981-443655
2820     Euro Shopping Channel    (91) 555 94 44
2821              Alpha Cognac        61.77.6555
2822         Gifts4AllAges.com        6175559555

                       ADDRESSLINE1           CITY POSTALCODE  COUNTRY  \
0           897 Long Airport Avenue            NYC      10022      USA
1                59 rue de l'Abbaye          Reims      51100   France
2     27 rue du Colonel Pierre Avia          Paris      75508   France
3                78934 Hillside Dr.       Pasadena      90003      USA
4                   7734 Strong St.  San Francisco      28034      USA
...                             ...            ...        ...      ...
2818             C/ Moralzarzal, 86         Madrid      28034    Spain
2819                    Torikatu 38           Oulu      90110  Finland
2820             C/ Moralzarzal, 86         Madrid      28034    Spain
2821          1 rue Alsace-Lorraine       Toulouse      31000   France
2822             8616 Spinnaker Dr.         Boston      51003      USA

     TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0         EMEA              Yu             Kwai    Small
1         EMEA         Henriot             Paul    Small
2         EMEA        Da Cunha           Daniel   Medium
3         EMEA           Young            Julie   Medium
4         EMEA           Brown            Julie   Medium
...        ...             ...              ...      ...
2818      EMEA          Freyre            Diego    Small
2819      EMEA       Koskitalo           Pirkko   Medium
2820      EMEA          Freyre            Diego   Medium
2821      EMEA          Roulet          Annette    Small
2822      EMEA         Yoshido             Juri   Medium

[2823 rows x 23 columns]

Cleaned data saved to 'cleaned_250902_data.csv'

In [3]:
!pip list

Package           Version
----------------- -----------
numpy             2.3.2
pandas            2.3.2
pip               25.2
python-dateutil   2.9.0.post0
pytz              2025.2
six               1.17.0
SQLAlchemy        2.0.43
typing_extensions 4.15.0
tzdata            2025.2